MusicApp/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Queen"], ["created_at", "2020-11-04 01:33:11.927730"], ["updated_at", "2020-11-04 01:33:11.927730"]]
---
    def create
        @band = Band.new(bands_params)
        if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
    def destroy
        @band = Band.find(params[:id])
        @band.destroy