MusicApp/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "_ya4ysr1lZ5RnwNUOnRUFA"], ["updated_at", "2020-11-03 19:18:54.699055"], ["id", 1]]